[
  {
    "title": "'Straight Outta Compton' Tops Box Office For Second Week",
    "site": "accesshollywood.com",
    "body": "\"Straight Outta Compton\" easily maintained its box-office lead with an estimated $26.8 million in ticket sales over a sleepy late summer weekend at the multiplexes.\"Straight Outta Compton\" easily maintained its box-office lead with an estimated $26.8 million in ticket sales over a sleepy late summer weekend at the multiplexes. The N.W.A biopic, a much buzzed-about hit, dominated over the late August releases that often characterize Hollywood's dog days of summer. It has now made $111.5 million in two weeks.\r The low-budget horror sequel \"Sinister 2\" fared the best of the new releases, opening with $10.6 million, according to studio estimates Sunday. Fox's assassin thriller \"Hitman: Agent 47,\" the second attempt to adapt the popular video game, disappointed with $8.2 million.\r Lionsgate's \"American Ultra,\" starring Kristen Stewart and Jesse Eisenberg, also failed to spark much interest, opening with $5.5 million.\r \"Mission: Impossible - Rogue Nation\" came in second with $11.7 million in its fourth week.\r"
  },
  {
    "title": "HBO Now Movies List 2015: Highlights From The September Lineup",
    "site": "ibtimes.com",
    "body": "As we close out the month of August and prepare to head back to school, there's one small silver lining: With the beginning of a new month comes the addition of new content to HBO Now -- meaning you'll at least have something to binge-watch once school's out.As we close out the month of August and prepare to head back to school, there's one small silver lining: With the beginning of a new month comes the addition of new content to HBO Now -- meaning you'll at least have something to binge-watch once school's out. As some may know, September marks the anniversary of two cult-classic movies, \"Bring it On\" and \"The Rocky Horror Picture Show.\" To celebrate, HBO is putting them at the front and center of their September movies additions. The titles will be available on the popular streaming service on Aug. 25 and Sept. 26 respectively.\r New series such as Ben Affleck and Matt Damon's \"Project Greenlight,\" and Funny or Die's \"Ferrell Takes the Field,\" starring comedian Will Ferrell, will also be added. Unfortunately, August will mark the last chance for people to see content on HBO Now that's leaving the streaming service for good. Hit movies such as \"Inside Man,\" starring Denzel Washington, and \"Wedding Crashers,\" starring Owen Wilson and \"True Detective\" Season 2's Vince Vaughn, will disappear from HBO Now in September.\r To ensure you don't miss out on any of the content coming to or leaving HBO Now next month, below is a rundown of the highlights that users should be on the lookout for.\r"
  },
  {
    "title": "Nintendo May Finally Start Making Movies Again",
    "site": "slashfilm.com",
    "body": "Nintendo made their first and only foray into motion pictures with the positively disastrous 1993 adaptation Super Mario Bros., which was recently skewered by the folks at Honest Trailers. Since then, the video game company has steered clear of bringing any of their other characters to the big screen, and we don't blame themNintendo made their first and only foray into motion pictures with the positively disastrous 1993 adaptation Super Mario Bros., which was recently skewered by the folks at Honest Trailers. Since then, the video game company has steered clear of bringing any of their other characters to the big screen, and we don't blame them But it's been 22 years now, and with a new deal at Universal Studios bringing Nintendo characters to life in a new theme park environment, the company might be turning over a new leaf when it comes to expanding the media reach of their most treasured characters to create some Nintendo movies.\r Nintendo's new stance on film adaptations came buried in a June report on the company's earnings (via Fortune) where the company said, \"For Nintendo IP, a more active approach will be taken in areas outside the video game business, including visual content production and character merchandising.\"\r As the world of media has become much more interconnected, Nintendo is now much more interested in integrating their video game creations into the world of movies, and maybe television.\r There have been hints of Nintendo heading into movies and television before with a Legend of Zelda series reported to be in development at Netflix, even though that was denied by the video game company. But over the years, Nintendo has still made it to the big screen with Bowser in Wreck-It Ralph, Donkey Kong in Pixels (and almost a Super Mario credits scene too) and more.\r But even with those cameos, it's not enough to satiate fans' appetite for seeing movies based on games like Legend of Zelda, Metroid, Kirby, Donkey Kong and maybe even a proper Super Mario Bros. movie. It's early days on seeing any Nintendo movies come to fruition, but this is at least a step in the right direction."
  },
  {
    "title": "The Cities With Too Few Sports Teams",
    "site": "huffingtonpost.com",
    "body": "What if the Denver Broncos became the Bridgeport Broncos? Or LeBron's Cavaliers played their home games in Riverside, California? Denver and Cleveland fans: calm down -- this isn't going to happen. But, from at least one perspective, it wouldn't be totally crazy if it did.What if the Denver Broncos became the Bridgeport Broncos? Or LeBron's Cavaliers played their home games in Riverside, California? Denver and Cleveland fans: calm down -- this isn't going to happen. But, from at least one perspective, it wouldn't be totally crazy if it did. There are a lot of reasons certain sports teams play in certain cities. While market size is important, it's far from the only consideration. Take Boston, for example. The Bruins, Celtics, Red Sox and Patriots have been playing in Beantown for an average of 82 years. The Patriots are the new guys in town, having just arrived in 1960. Even if there were more demand for one of those teams in another market, it's not likely a sports commissioner would try to uproot one of Boston's storied franchises.\r When it comes to expansion and relocation, politics and personal agendas come into play. The willingness of a given city to fund a shiny new stadium can make or break an expansion deal. Likewise, a team's owner may favor a city with a smaller market if it means staying close to home and showing off the new toy to all their friends. Not everyone can fly 1,000 miles to attend every game, as LA Clippers owner Steve Ballmer does.\r In short, the landscape of American professional sports has been shaped by far more than sound financial logic. The result is messy and in some cases just plain weird. (Ever been to Green Bay?) So what would the sports world look like if each city had the \"right\" number of teams?\r To determine the optimal number of sports teams in U.S. cities, we looked at data on population and mean household income for each of America's largest 100 metro areas. This reflects both the size of a given market and the amount of income after taxes the people in that market have to spend on tickets, gear and (generally outrageously expensive) stadium concessions.\r Using that data, we developed a model to predict the number of \"big-four\" men's sports franchises1 in U.S. metro areas. Specifically, we ran a linear least-squares regression of the number of franchises on the population and mean household income.\r"
  },
  {
    "title": "Usain Bolt defeats Justin Gatlin to defend 100-meter world title",
    "site": "si.com",
    "body": "Usain Bolt will head into the 2016 Summer Olympics with the title of '15 world champion after defeating American Justin Gatlin with a 9.79-second victory in the men's 100-meter final at the IAAF World Championships in Beijing. Gatlin took second in 9.80. NCAA stars Trayvon Bromell of USA and Andre De Grasse of Canada tied for bronze in 9.911.Usain Bolt will head into the 2016 Summer Olympics with the title of '15 world champion after defeating American Justin Gatlin with a 9.79-second victory in the men's 100-meter final at the IAAF World Championships in Beijing. Gatlin took second in 9.80. NCAA stars Trayvon Bromell of USA and Andre De Grasse of Canada tied for bronze in 9.911. Bolt has won three of the last four world-championship titles in the 100-meter dash. He is the third man after Carl Lewis (1983, '87 and '91) and Maurice Greene (1997, '99 and 2001) to win three world-championship titles.\r Bolt's reaction time of .159 seconds was faster than Gatlin's .165 seconds. Gatlin appeared to have the race won with about 20 meters remaining before his form fell apart and Bolt capitalized.\r \"Everyone wants to win,\" Gatlin said after the race. \"I came out here and got nipped at the line by the great Usain.\"\r An American has finished second in each of the last four world championships.\r Bolt extended his longest winning streak by days, which dates back to June 2013. In that span of time, Bolt won gold medals in the 100-meter and 200-meter dash at the 2013 IAAF World Championships but missed most of the '14 campaign with a foot injury. Bolt scratched from a few meets this July after suffering a blocked sacroiliac joint injury.\r Gatlin was handed his first loss since Sept. 6, 2013. The American lost to Bolt in the 100-meter final at the 2013 world championships in Moscow, but defeated the Jamaican star in their previous meeting at the Rome Diamond League Meeting that June.\r"
  },
  {
    "title": "Cards fan 16 times in loss; Carpenter ejected",
    "site": "stltoday.com",
    "body": "Seven runners allowed by baseball's best bullpen to score in just one inning. Or 16 strikeouts by Cardinals hitters. Choose your poison.Seven runners allowed by baseball's best bullpen to score in just one inning. Or 16 strikeouts by Cardinals hitters. Choose your poison. Both were unpalatable Saturday night for the Cardinals at sold-out Petco Park as a strong outing by Carlos Martinez was spoiled by a San Diego seventh inning which raged out of control and the Padres stormed off to an 8-0 victory.\r The Padres, the only team in the National League with a winning record against the Cardinals, have taken four of six from them with only Sunday's game remaining.\r San Diego has won five straight overall and seven of eight. The Cardinals' lead over second-place Pittsburgh in the National League Central has shriveled to 3 1\/2 games.\r Manager Mike Matheny, asked which magic number was worse - 7 or 16 - was in no mood to try to decide.\r \"Neither (is) something we have in our game plan to help us win,\" said Matheny. \"Both are working against us and, once again, one of those innings that kind of blew up on us.\"\r For the second time in two nights, the Padres scored four or more runs in an inning against the Cardinals.\r Six of the Cardinals' strikeouts came with men in scoring position. The most critical may have been Matt Carpenter's 100th of the season and one which ended his night.\r With the Cardinals down 1-0 to Ian Kennedy, who would strike out 10 in six innings, Tommy Pham, who had three hits, doubled with one out in the fifth and Martinez, enjoying a multi-hit game, beat out a grounder behind second with Pham stopping at third.\r Nothing for his last 16, Carpenter was looking at least to tie the score but was called out by young umpire Chris Segal on an 0-2 pitch ball that appeared outside. Outside so much that catcher Derek Norris didn't really even try to frame it.\r Carpenter barked at minor league call-up Segal and quickly was ejected. Matheny arrived in time before anything else happened, holding an agitated Carpenter away from Segal while Matheny continued to plead the cause.\r Kennedy then fanned Stephen Piscotty, who would strike out three times."
  },
  {
    "title": "Hackers Cut a Corvette's Brakes Via a Common Car Gadget",
    "site": "wired.com",
    "body": "CAR HACKING DEMOS like last month's over-the-internet hijacking of a Jeephave shown it's possible for digital attackers to cross the gap between a car's cellular-connected infotainment system and its steering and brakes. But a new piece of research suggests there may be an even easier way for hackers to wirelessly access those critical driving functions: Through an entire industry of potentially insecure, internet-enabled gadgets plugged directly into cars' most sensitive guts.CAR HACKING DEMOS like last month's over-the-internet hijacking of a Jeephave shown it's possible for digital attackers to cross the gap between a car's cellular-connected infotainment system and its steering and brakes. But a new piece of research suggests there may be an even easier way for hackers to wirelessly access those critical driving functions: Through an entire industry of potentially insecure, internet-enabled gadgets plugged directly into cars' most sensitive guts. At the Usenix security conference today, a group of researchers from the University of California at San Diego plan to reveal a technique they could have used to wirelessly hack into any of thousands of vehicles through a tiny commercial device: A 2-inch-square gadget that's designed to be plugged into cars' and trucks' dashboards and used by insurance firms and trucking fleets to monitor vehicles' location, speed and efficiency. By sending carefully crafted SMS messages to one of those cheap dongles connected to the dashboard of a Corvette, the researchers were able to transmit commands to the car's CAN bus-the internal network that controls its physical driving components-turning on the Corvette's windshield wipers and even enabling or disabling its brakes.\r \"We acquired some of these things, reverse engineered them, and along the way found that they had a whole bunch of security deficiencies,\" says Stefan Savage, the University of California at San Diego computer security professor who led the project. The result, he says, is that the dongles \"provide multiple ways to remotely...control just about anything on the vehicle they were connected to.\"\r In the video below, the researchers demonstrate their proof-of-concept attacks on a 2013 Corvette, messing with its windshield wipers and both activating and cutting its brakes. Though the researchers say their Corvette brake tricks only worked at low speeds due to limitations in the automated computer functions of the vehicle, they say they could have easily adapted their attack for practically any other modern vehicle and hijacked other critical components like locks, steering or transmission.\r"
  },
  {
    "title": "Want to skip the order line? Fast food restaurants have apps for that.",
    "site": "fredericksburg.com",
    "body": "You don't have time to wait in a long line to get your morning caffeine fix or to grab your lunch. If only you could skip the line.You don't have time to wait in a long line to get your morning caffeine fix or to grab your lunch. If only you could skip the line. Well, there's an app for that.\r More restaurants are offering free apps billed as providing greater convenience to consumers, appealing particularly to millennials who are early adopters of technology and often glued to their smartphones. With the touch of an app, customers can order ahead of time, pay in advance and even bypass other walk-in customers when picking up their orders. They also can get special offers or earn rewards points and, at the very least, look at menus and find locations.\r This fall, McDonald's is planning to launch an app with coupons nationally in October, joining the growing list of fast food chains offering free apps in the App Store and Google Play Store. Before the end of the year, Starbucks will have rolled out its mobile order and pay feature on the app nationwide so coffee drinkers can customize their Starbucks beverage and see the wait times before selecting a store for pick up.\r Consumers are indeed checking out the apps, as 28 percent of adults-and that stat jumps higher, to 40 percent of millennials-have downloaded a restaurant app in a three-month period, according to recent survey in 2014 by Technomic, a Chicago-based food service consultant.\r \"As the app market gets more crowded, the better ones will win on efficiency, how easy is it to use and what they give the consumer, what's the benefit,\" said Derek Rucker, marketing professor at Northwestern University's Kellogg School of Management.\r Unless delivery is an option, the app still requires customers to pick up their orders at restaurants. An app has the \"potential\" to save time for consumers, Rucker said.\r For example, if customers order through the app, they wouldn't have to wait in lines to place the orders because their orders are already in the queue. Mobile ordering also can solve any miscommunication problem about getting the order right, he said.\r Some restaurants allow customers to link up their debit and credit cards to the app on the phone. Even without the capability of ordering online, scanning the phone at the register to purchase the order can help speed up service, said Sara Gramling, Magnolia Bakery's vice president of public relations. Last month, Magnolia Bakery unveiled an app for customers in Chicago, Los Angeles and New York.\r \"At times, Magnolia can get very busy and it moves the line faster. The more people are paying with their phones, the quicker they can get through the line,\" she said.\r Mobile payments, a feature available since 2011 at Starbucks, represent 20 percent of all in-store transactions in U.S. with the coffee powerhouse processing nearly 9 million mobile payments each week, a spokeswoman said.\r Not all quick-service and fast-casual restaurants are competing on the same level when it comes to integrating technology into their restaurants.\r \"It's kind of the early days for most fast-food restaurants. I think consumers are willing to experiment a little bit and get comfortable with the apps,\" said Jackie Dulen Rodriguez, senior manager at Technomic Inc.\r There's some debate on whether the apps are filling a need, solving a problem or improving the restaurant experience, she said. Speed of service is high on the list of priorities for fast food customers, she said.\r"
  },
  {
    "title": "Google is finally solving Android's bloatware problem",
    "site": "bgr.com",
    "body": "If there's one thing Android and iPhone users have in common, it's their mutual hatred of bloatware. There's just something inherently frustrating about getting a new device and seeing pre-loaded applications that you have no use for and, even worse, can't get rid of.If there's one thing Android and iPhone users have in common, it's their mutual hatred of bloatware. There's just something inherently frustrating about getting a new device and seeing pre-loaded applications that you have no use for and, even worse, can't get rid of. There is good news on this front, however, as upcoming Android devices won't be infused with as much bloatware as you've grown accustomed to.\r AndroidCentral is reporting that Google recently implemented a few changes to the standard contract it sends out to handset manufacturers. Previously, OEMs who wanted to have apps like Gmail and Google Maps pre-installed on devices were effectively forced to install an entire bundle of Google apps, including Google+ Google Newsstand.\r With the recent changes, the selection of pre-installed Google apps will now be much less intrusive.\r While this is a welcome move from Google, Android users won't be entirely free from bloatware as we'll still have to deal with pesky carriers loading up devices with their own broad selection of apps that no one has any use for. Depending on your carrier and device, you may still run into old friends like AT&T Navigator, AT&T Family Map, Sprint Zone, Nascar, Verizon Messages and more.\r So yeah, there's still some progress to be made on the bloatware front, but this is still an encouraging start."
  }
]